In [62]:
import numpy as np
import pandas as pd
from numpy import random

In [23]:
labels = ['a','b','c']
data = [1,2,3]
tup=(11,12,13)
dic={'a':10,'b':20,'c':30}

In [3]:
labels

['a', 'b', 'c']

In [4]:
tup

(1, 2, 3)

In [5]:
dic

{'a': 10, 'b': 20, 'c': 30}

In [13]:
dic.values()

dict_values([10, 20, 30])

In [10]:
dic.get('a')

10

In [14]:
dic['a']

10

In [15]:
dic

{'a': 10, 'b': 20, 'c': 30}

In [20]:
dic.keys()

dict_keys(['a', 'b', 'c'])

In [35]:
ser1=pd.Series(data,labels)
ser1

a    1
b    2
c    3
dtype: int64

In [31]:
ser2=pd.Series(tup,labels)

In [32]:
ser1+ser2

a    12
b    14
c    16
dtype: int64

In [33]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [82]:
ser1[2]

3

In [81]:
np.random.seed(101)

In [104]:
ran=random.randint(10,size=(5,4))
ran

array([[6, 5, 6, 9],
       [2, 2, 1, 3],
       [3, 3, 4, 5],
       [9, 5, 8, 3],
       [6, 8, 7, 5]])

In [105]:
df = pd.DataFrame(ran,['A','B','C','D','E'],['W','X','Y','Z'])
df

   W  X  Y  Z
A  6  5  6  9
B  2  2  1  3
C  3  3  4  5
D  9  5  8  3
E  6  8  7  5

In [106]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])

In [107]:
df

          W         X         Y         Z
A  0.536175  0.144883 -0.627879  1.151898
B  0.259370 -1.186527 -0.673861 -1.555119
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672
E -1.562469 -0.676467 -1.617897 -1.818591

In [108]:
df['W']

A    0.536175
B    0.259370
C   -0.566604
D   -0.888242
E   -1.562469
Name: W, dtype: float64

In [115]:
df[['W','Z']]

          W         Z
A  0.536175  1.151898
B  0.259370 -1.555119
C -0.566604  1.028012
D -0.888242  1.414672
E -1.562469 -1.818591

In [116]:
df['New']=df['W']+df['Z']

In [117]:
df

          W         X         Y         Z       New
A  0.536175  0.144883 -0.627879  1.151898  1.688073
B  0.259370 -1.186527 -0.673861 -1.555119 -1.295750
C -0.566604 -0.790608  0.230762  1.028012  0.461408
D -0.888242 -2.141687 -0.976076  1.414672  0.526430
E -1.562469 -0.676467 -1.617897 -1.818591 -3.381059

In [120]:
df.drop('New',axis=1)

          W         X         Y         Z
A  0.536175  0.144883 -0.627879  1.151898
B  0.259370 -1.186527 -0.673861 -1.555119
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672
E -1.562469 -0.676467 -1.617897 -1.818591

In [121]:
df

          W         X         Y         Z       New
A  0.536175  0.144883 -0.627879  1.151898  1.688073
B  0.259370 -1.186527 -0.673861 -1.555119 -1.295750
C -0.566604 -0.790608  0.230762  1.028012  0.461408
D -0.888242 -2.141687 -0.976076  1.414672  0.526430
E -1.562469 -0.676467 -1.617897 -1.818591 -3.381059

In [122]:
df.drop('New',axis=1,inplace=True)

In [123]:
df

          W         X         Y         Z
A  0.536175  0.144883 -0.627879  1.151898
B  0.259370 -1.186527 -0.673861 -1.555119
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672
E -1.562469 -0.676467 -1.617897 -1.818591

In [124]:
df.drop('E',axis=0)

          W         X         Y         Z
A  0.536175  0.144883 -0.627879  1.151898
B  0.259370 -1.186527 -0.673861 -1.555119
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672

In [125]:
df

          W         X         Y         Z
A  0.536175  0.144883 -0.627879  1.151898
B  0.259370 -1.186527 -0.673861 -1.555119
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672
E -1.562469 -0.676467 -1.617897 -1.818591

In [128]:
df.loc['A']

W    0.536175
X    0.144883
Y   -0.627879
Z    1.151898
Name: A, dtype: float64

In [131]:
df.iloc[0]

W    0.536175
X    0.144883
Y   -0.627879
Z    1.151898
Name: A, dtype: float64

In [132]:
df.iloc[0,1]

0.14488267625018927

In [133]:
df.iloc[[0,1],[0,1]]

          W         X
A  0.536175  0.144883
B  0.259370 -1.186527

In [138]:
booldf=df>0
booldf

       W      X      Y      Z
A   True   True  False   True
B   True  False  False  False
C  False  False   True   True
D  False  False  False   True
E  False  False  False  False

In [139]:
df[booldf]

          W         X         Y         Z
A  0.536175  0.144883       NaN  1.151898
B  0.259370       NaN       NaN       NaN
C       NaN       NaN  0.230762  1.028012
D       NaN       NaN       NaN  1.414672
E       NaN       NaN       NaN       NaN

In [144]:
df[df['W']<0]['X']

C   -0.790608
D   -2.141687
E   -0.676467
Name: X, dtype: float64

In [148]:
df[df['Z']>0][['X','Y']]

          X         Y
A  0.144883 -0.627879
C -0.790608  0.230762
D -2.141687 -0.976076

In [156]:
df[(df['W']<0) | (df['Y']>1)]

          W         X         Y         Z
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672
E -1.562469 -0.676467 -1.617897 -1.818591

In [157]:
df

          W         X         Y         Z
A  0.536175  0.144883 -0.627879  1.151898
B  0.259370 -1.186527 -0.673861 -1.555119
C -0.566604 -0.790608  0.230762  1.028012
D -0.888242 -2.141687 -0.976076  1.414672
E -1.562469 -0.676467 -1.617897 -1.818591

In [158]:
df.reset_index()

  index         W         X         Y         Z
0     A  0.536175  0.144883 -0.627879  1.151898
1     B  0.259370 -1.186527 -0.673861 -1.555119
2     C -0.566604 -0.790608  0.230762  1.028012
3     D -0.888242 -2.141687 -0.976076  1.414672
4     E -1.562469 -0.676467 -1.617897 -1.818591

In [159]:
newindx = 'CA NA VB CO DA'.split()

In [160]:
newindx

['CA', 'NA', 'VB', 'CO', 'DA']

In [161]:
df['states']=newindx

In [162]:
df

          W         X         Y         Z states
A  0.536175  0.144883 -0.627879  1.151898     CA
B  0.259370 -1.186527 -0.673861 -1.555119     NA
C -0.566604 -0.790608  0.230762  1.028012     VB
D -0.888242 -2.141687 -0.976076  1.414672     CO
E -1.562469 -0.676467 -1.617897 -1.818591     DA

In [165]:
df.set_index('states')

               W         X         Y         Z
states
CA      0.536175  0.144883 -0.627879  1.151898
NA      0.259370 -1.186527 -0.673861 -1.555119
VB     -0.566604 -0.790608  0.230762  1.028012
CO     -0.888242 -2.141687 -0.976076  1.414672
DA     -1.562469 -0.676467 -1.617897 -1.818591

In [166]:
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))

In [167]:
hier_index

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [169]:
hier_index=pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [171]:
  df=pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [172]:
df

             A         B
G1 1  0.171447  0.377750
   2  1.049934 -0.526008
   3 -0.304556 -0.484535
G2 1  0.053539 -2.024119
   2  0.796184  2.457297
   3 -2.288978  0.441018

In [173]:
df.loc['G1']

          A         B
1  0.171447  0.377750
2  1.049934 -0.526008
3 -0.304556 -0.484535

In [175]:
df.loc['G1'].loc[1]

A    0.171447
B    0.377750
Name: 1, dtype: float64

In [176]:
d= {'a':[1,2,np.nan],'b':[3,np.nan,np.nan],'c':[4,5,6]}

In [177]:
d

{'a': [1, 2, nan], 'b': [3, nan, nan], 'c': [4, 5, 6]}

In [178]:
df = pd.DataFrame(d)

In [179]:
df

     a    b  c
0  1.0  3.0  4
1  2.0  NaN  5
2  NaN  NaN  6

In [180]:
df.dropna()

     a    b  c
0  1.0  3.0  4

In [181]:
df.dropna(axis=1)

   c
0  4
1  5
2  6

In [182]:
df.fillna(value=5)

     a    b  c
0  1.0  3.0  4
1  2.0  5.0  5
2  5.0  5.0  6

In [191]:
df.fillna(value=df.mean())

     a    b  c
0  1.0  3.0  4
1  2.0  3.0  5
2  1.5  3.0  6

In [195]:
d.keys()

dict_keys(['a', 'b', 'c'])

In [199]:
data = {'Company':['GOOGLE','GOOGLE','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [200]:
df=pd.DataFrame(data)

In [201]:
df

  Company   Person  Sales
0  GOOGLE      Sam    200
1  GOOGLE  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [206]:
df.groupby('Company').sum()

         Sales
Company
FB         593
GOOGLE     320
MSFT       464

In [207]:
df.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOGLE        2      2
MSFT          2      2

In [212]:
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [213]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOGLE    2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [214]:
df.groupby('Company').describe().transpose()

Company              FB      GOOGLE        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

In [215]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [228]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4, 5, 6, 7])

In [229]:
df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                        'B': ['B8', 'B9', 'B10', 'B11'],
                        'C': ['C8', 'C9', 'C10', 'C11'],
                        'D': ['D8', 'D9', 'D10', 'D11']},
                        index=[8, 9, 10, 11])

In [230]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [231]:
df2

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [232]:
df3

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [233]:
 pd.concat([df1,df2,df3])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [234]:
left = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
   
right = pd.DataFrame({'key': ['K0', 'K1', 'K2', 'K3'],
                          'C': ['C0', 'C1', 'C2', 'C3'],
                          'D': ['D0', 'D1', 'D2', 'D3']})

In [235]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [236]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [237]:
pd.merge(left,right)

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [238]:
pd.merge(left,right,on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [240]:
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [241]:
left = pd.DataFrame({'key1': ['K0', 'K0', 'K1', 'K2'],
                     'key2': ['K0', 'K1', 'K0', 'K1'],
                        'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['K0', 'K1', 'K1', 'K2'],
                               'key2': ['K0', 'K0', 'K0', 'K0'],
                                  'C': ['C0', 'C1', 'C2', 'C3'],
                                  'D': ['D0', 'D1', 'D2', 'D3']})

In [242]:
pd.merge(left,right,how='inner',on='key1')

  key1 key2_x   A   B key2_y   C   D
0   K0     K0  A0  B0     K0  C0  D0
1   K0     K1  A1  B1     K0  C0  D0
2   K1     K0  A2  B2     K0  C1  D1
3   K1     K0  A2  B2     K0  C2  D2
4   K2     K1  A3  B3     K0  C3  D3

In [243]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [244]:
right

  key1 key2   C   D
0   K0   K0  C0  D0
1   K1   K0  C1  D1
2   K1   K0  C2  D2
3   K2   K0  C3  D3

In [249]:
pd.merge(left,right,how='inner',on=['key1','key2'])

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [250]:
pd.merge(left,right,how='left',on=['key1','key2'])

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [251]:
pd.merge(left,right,how='right',on=['key1','key2'])

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3